{
  "meta": {
    "name": "MāyāLucIA",
    "version": "0.1",
    "description": "A personal computational environment for scientific understanding through creation"
  },
  "bodies": [
    {
      "id": "mayalucia",
      "label": "MāyāLucIA",
      "kind": "galaxy-center",
      "mass": 1.0,
      "color": [1.0, 0.85, 0.3],
      "children": ["mayaportal", "mayajiva", "bravli", "mayapramana", "manifesto", "mayadevgeni", "mayaloom"],
      "description": "A personal computational environment for scientific understanding through creation.",
      "status": "active",
      "facets": [
        { "title": "Core Cycle", "text": "Measure → Model → Manifest → Evaluate → Refine. Starting from sparse measurements of natural systems, scientific models propagate constraints to reconstruct dense, self-consistent digital twins." },
        { "title": "The Sculptor", "text": "Measurement is the raw material. Scientific models are the conceptual chisel. The digital twin is the revealed sculpture. The scientist sculpts — the agent assists, translates, and challenges." },
        { "title": "Markram's Hypothesis", "text": "In any complex natural system, all parameters are interdependent. A few anchor measurements implicitly constrain the rest — provided you have the right models to capture the interdependencies." },
        { "title": "Brain Circuits", "text": "Reconstructing cortical microcircuits from sparse morphological and connectivity data. Building on Blue Brain / Open Brain Institute methodology." },
        { "title": "Mountain Valleys", "text": "Digital twins of Himalayan landscapes integrating geology, hydrology, ecology, and human impact. The Parvati Valley as first case study." },
        { "title": "The Feynman Imperative", "text": "What I cannot create, I do not understand. Understanding emerges through the act of building — not observing, not consuming, but reconstructing from first principles." },
        { "title": "Domains", "text": "Brain circuits, mountain valleys, protein dynamics, quantum sensors — each domain drives development of shared infrastructure while remaining scientifically autonomous." },
        { "title": "Architecture", "text": "Eight planned modules: MāyāCore, MāyāDana, MāyāKalpa, MāyāNāṭya, Sūtra, Śāstra, Tīrtha, Dhyāna — mapping onto the Measure-Model-Manifest-Evaluate cycle." }
      ]
    },
    {
      "id": "mayaportal",
      "label": "MāyāPortal",
      "kind": "star",
      "mass": 0.7,
      "color": [0.2, 0.6, 1.0],
      "domain": "rendering",
      "children": ["portal-wgpu", "portal-sdl3", "portal-codev"],
      "description": "Visual synthesis kernel. C++23 rendering engine built on SDL3 and WebGPU.",
      "status": "active",
      "facets": [
        { "title": "Architecture", "text": "Pure core / effectful shell. Physics and geometry computations are pure functions; platform interaction (windowing, GPU) lives at the shell boundary." },
        { "title": "Stack", "text": "C++23 with wgpu-native for cross-platform GPU abstraction. SDL3 for windowing and input. CMake build system with FetchContent for dependencies." },
        { "title": "Literate Source", "text": "Source of truth lives in org-mode files under codev/. Code is tangled from prose — the narrative is the specification. Never edit generated source directly." },
        { "title": "Role", "text": "The manifestation layer — where digital twins become visible, audible, tangible. MāyāNāṭya's rendering kernel, the first concrete module implementation." },
        { "title": "WebGPU", "text": "Using wgpu-native rather than browser WebGPU. Cross-platform from day one: Linux, macOS, Windows, and eventually web via wasm." },
        { "title": "Current State", "text": "Active development. Basic rendering pipeline functional. Literate source structure established in codev/. Wireframe and flat-shaded polytope rendering working." }
      ]
    },
    {
      "id": "mayajiva",
      "label": "MāyāJīva",
      "kind": "star",
      "mass": 0.5,
      "color": [0.3, 0.9, 0.4],
      "domain": "simulation",
      "children": ["jiva-core", "jiva-godot"],
      "description": "Magnetic bug simulation. Emergent collective behaviour from simple local rules.",
      "status": "active",
      "facets": [
        { "title": "Core Design", "text": "Header-only C++ core in src/core/, namespace mayajiva. Templated on N_CHANNELS for compile-time channel count. Zero runtime overhead for channel selection." },
        { "title": "Emergence", "text": "Simple local rules — magnetic alignment, nearest-neighbour interaction — produce collective behaviour: flocking, vortices, phase transitions. The whole exceeds the sum." },
        { "title": "Validation", "text": "23 tests passing. Python generates reference JSON, Catch2 tests compare C++ output. Cross-language validation ensures the physics is right." },
        { "title": "Godot Integration", "text": "GDExtension binding for Godot 4. Real-time visualization of emergent swarm dynamics. The simulation core remains pure; Godot is the shell." },
        { "title": "Build", "text": "CMake with FetchContent for Catch2 v3.5.2 and nlohmann/json v3.11.3. GCC 11.4.0, C++20 standard." },
        { "title": "Inspiration", "text": "Magnetic bugs as a minimal model of collective intelligence. From statistical mechanics to swarm behaviour — the interacting particle systems that drive MāyāLucIA's philosophy." }
      ]
    },
    {
      "id": "bravli",
      "label": "Bravli",
      "kind": "star",
      "mass": 0.6,
      "color": [0.9, 0.3, 0.5],
      "domain": "neuroscience",
      "description": "Brain building toolkit. 293 tests covering neurons, networks, synapses, neuromodulation.",
      "status": "active",
      "facets": [
        { "title": "Scope", "text": "LIF and AdEx neurons, Brunel networks, stochastic synapses, neuromodulation, mushroom body dynamics. A comprehensive toolkit for computational neuroscience." },
        { "title": "Validation", "text": "293 tests verified. First manuscript checked against simulation output. Every claim in the paper backed by reproducible code." },
        { "title": "Methodology", "text": "Built on Blue Brain / Open Brain Institute methodology. Sparse morphological and connectivity data propagated through biophysical models to reconstruct dense microcircuits." },
        { "title": "Architecture", "text": "Pure numerical core with clean separation of neuron models, network topology, and simulation engine. Errors as values, not exceptions." },
        { "title": "Brunel Networks", "text": "Balanced excitation-inhibition networks exhibiting asynchronous irregular firing. The canonical model of cortical dynamics, implemented and validated." },
        { "title": "Mushroom Body", "text": "Insect olfactory learning circuit. Sparse coding, Kenyon cells, lateral inhibition. A minimal circuit for understanding associative memory." }
      ]
    },
    {
      "id": "mayapramana",
      "label": "MāyāPramāṇa",
      "kind": "star",
      "mass": 0.65,
      "color": [0.7, 0.4, 1.0],
      "domain": "quantum-sensing",
      "children": ["pramana-bloch", "pramana-demo"],
      "description": "Universal quantum sensor controller — digital twins of quantum sensors.",
      "status": "active",
      "facets": [
        { "title": "Trilingual", "text": "Python for exploration, Haskell for specification, C++ for deployment. Each language plays to its strength. Cross-language validation ensures consistency." },
        { "title": "For Saikat", "text": "Built for Dr. Saikat Ghosh, IIT Kanpur — quantum measurement expert and founder of Qmet Tech. The invitation leads with git clone and a live demo." },
        { "title": "Architecture", "text": "Pure core / effectful shell with monadic composition. Physics is pure functions; hardware interaction at the boundary. FP grammar throughout." },
        { "title": "Bloch Equations", "text": "Lesson 00: the hello world of quantum sensing. RK4 integrator, T1/T2 relaxation, Rabi oscillation — the foundation everything else builds on." },
        { "title": "MāyāLoom", "text": "First project to use cadenza-annotated literate documents. Loom manifests declare concepts, prerequisites, anti-targets. Knowledge weaving made concrete." },
        { "title": "Vision", "text": "Every quantum sensor — NV centres, atomic clocks, magnetometers — as a digital twin. Simulate before you measure. Understand before you build." }
      ]
    },
    {
      "id": "manifesto",
      "label": "Manifesto",
      "kind": "planet",
      "mass": 0.3,
      "color": [1.0, 0.6, 0.2],
      "domain": "philosophy",
      "description": "The philosophical foundation of MāyāLucIA.",
      "status": "stable",
      "facets": [
        { "title": "The Sculptor's Paradox", "text": "The tool that offers no resistance teaches nothing. Push back on flawed reasoning. Offer alternatives. The collaboration needs friction — and the friction between human and machine is where understanding lives." },
        { "title": "Measure → Manifest", "text": "The core cycle: Measure, Model, Manifest, Evaluate, Refine. Sparse observations become dense digital twins through scientific models that propagate constraints." },
        { "title": "Epistemic Hygiene", "text": "Separate what is known from what is inferred from what is speculated. Use calibrated language. No false confidence, no sycophancy, no papering over uncertainty with fluent prose." },
        { "title": "Markram's Bet", "text": "All parameters in a complex natural system are interdependent. A few anchor measurements implicitly constrain the rest. This is the radical hypothesis that drives the reconstructive approach." },
        { "title": "Neither Subordinate", "text": "Human and machine as complementary intelligences. The human contributes embodied intuition and judgment; the machine contributes rapid traversal of conceptual space and tireless attention to detail." },
        { "title": "Constant Seeking", "text": "Treat every input as creative direction for a joint pilgrimage of understanding. The artifact is a byproduct, not the purpose. Linger in the question before converging on an answer." }
      ]
    },
    {
      "id": "mayadevgeni",
      "label": "MāyāDevGenī",
      "kind": "star",
      "mass": 0.4,
      "color": [0.9, 0.8, 0.2],
      "domain": "methodology",
      "description": "Human-machine collaboration framework. The art of productive friction.",
      "status": "stable",
      "facets": [
        { "title": "Origin", "text": "Born from the recognition that AI collaboration requires a methodology — not just prompts, but shared principles, epistemic standards, and creative tension." },
        { "title": "Productive Friction", "text": "The tool that offers no resistance teaches nothing. DevGenī encodes the rules of engagement: when to push back, when to defer, when to linger in ambiguity." },
        { "title": "Calibrated Language", "text": "Known, inferred, speculated — always marked. Confidence levels explicit. No fluent prose masking uncertainty. The methodology demands honesty from both sides." },
        { "title": "Spawns MāyāLoom", "text": "DevGenī's collaboration principles gave birth to MāyāLoom — the cadenza system for annotating knowledge. Method begets infrastructure." },
        { "title": "Plan + Spec", "text": "Every collaboration produces two artifacts: plan.org (why, human-facing, authoritative) and spec.org (what, machine-facing, derived). If they disagree, the plan wins." },
        { "title": "The Human Side", "text": "PhD physicist, 20 years across academia and industry. Interacting particle systems, stochastic processes, computational neuroscience. Works from Emacs with org-babel." }
      ]
    },
    {
      "id": "mayaloom",
      "label": "MāyāLoom",
      "kind": "planet",
      "mass": 0.35,
      "color": [0.5, 0.9, 0.9],
      "domain": "knowledge-weaving",
      "description": "Tānā-bānā — the warp and weft of human-machine understanding.",
      "status": "cycle-1-complete",
      "facets": [
        { "title": "Kabir's Weaving", "text": "Named for the weaver-saint's loom. Tānā (warp) is structure; bānā (weft) is narrative. Knowledge emerges where they cross — neither thread alone makes cloth." },
        { "title": "Cadenza", "text": "Six fields per cadenza: :concept, :level, :prereqs, :assumes, :anti-targets, :connects-to. A musical term — the soloist's improvisation within the orchestra's structure." },
        { "title": "Loom Manifest", "text": "#+LOOM:, #+DEFINES:, #+DEPENDS:, #+EXPORTS:, #+CADENZAS: — org-mode headers that declare what a document teaches, needs, and connects to." },
        { "title": "Validated", "text": "Cycle 1 complete. A fresh agent parsed the manifest, found the cadenza, generated a correct tutorial. The format works — machine-readable knowledge weaving." },
        { "title": "Three Agreements", "text": "Human writes the structure. Machine reads the annotations. Both honour the contracts. The loom works only when both sides hold their threads taut." },
        { "title": "Next", "text": "Human reading pass, test remaining cadenzas, annotate future lessons across MāyāPramāṇa and beyond. The loom is built; now we weave." }
      ]
    },
    {
      "id": "portal-wgpu",
      "label": "WebGPU",
      "kind": "moon",
      "mass": 0.15,
      "color": [0.3, 0.5, 0.9],
      "description": "wgpu-native rendering backend. Cross-platform GPU abstraction.",
      "facets": [
        { "title": "Why wgpu", "text": "Cross-platform from day one. One API for Vulkan, Metal, DX12, and eventually WebGPU in the browser." },
        { "title": "Native Path", "text": "Using wgpu-native C bindings rather than browser WebGPU. Desktop-first, web later via wasm compilation." },
        { "title": "Pipeline", "text": "Render pipeline, compute shaders, buffer management — all through wgpu's safe abstraction over platform-specific GPU APIs." }
      ]
    },
    {
      "id": "portal-sdl3",
      "label": "SDL3",
      "kind": "moon",
      "mass": 0.12,
      "color": [0.4, 0.7, 0.9],
      "description": "SDL3 windowing and input. Platform layer for MāyāPortal.",
      "facets": [
        { "title": "Platform Layer", "text": "SDL3 handles windowing, input events, and platform abstraction. The shell boundary — everything outside is pure." },
        { "title": "SDL3 vs SDL2", "text": "SDL3 brings a modernized API, better GPU integration, and improved event handling. Worth the migration from SDL2." },
        { "title": "Input", "text": "Keyboard, mouse, gamepad — unified input handling. The bridge between human intention and digital twin interaction." }
      ]
    },
    {
      "id": "portal-codev",
      "label": "Literate Source",
      "kind": "moon",
      "mass": 0.1,
      "color": [0.5, 0.8, 1.0],
      "description": "Org-mode literate source in codev/. The narrative is the specification.",
      "facets": [
        { "title": "Why Literate", "text": "Code tangled from prose. The reasoning lives alongside the implementation. You read a story; the compiler reads instructions. Same source, two audiences." },
        { "title": "Org-Babel", "text": "Emacs org-babel tangles code blocks into source files. The .org file is authoritative; generated .cpp and .h are derived artifacts." },
        { "title": "codev/", "text": "All literate source lives under codev/. Each org file covers a coherent module or subsystem. The directory structure mirrors the architecture." }
      ]
    },
    {
      "id": "jiva-core",
      "label": "C++ Core",
      "kind": "moon",
      "mass": 0.12,
      "color": [0.2, 0.8, 0.3],
      "description": "Header-only C++ simulation core. Templated on N_CHANNELS.",
      "facets": [
        { "title": "Header-Only", "text": "The entire simulation core is header-only. Include and use — no separate compilation step. Templates resolve at compile time." },
        { "title": "N_CHANNELS", "text": "Templated on channel count. Compile-time polymorphism — no virtual dispatch, no runtime overhead for channel selection." },
        { "title": "Pure Core", "text": "No I/O, no side effects. Pure functions that take state and return new state. The shell (Godot, tests) handles all effectful operations." }
      ]
    },
    {
      "id": "jiva-godot",
      "label": "Godot Extension",
      "kind": "moon",
      "mass": 0.1,
      "color": [0.4, 0.9, 0.5],
      "description": "GDExtension binding for Godot 4. Real-time swarm visualization.",
      "facets": [
        { "title": "GDExtension", "text": "Godot 4's native extension system. C++ simulation core exposed to Godot's scene tree without going through GDScript." },
        { "title": "Real-Time", "text": "Thousands of magnetic bugs rendered and simulated at interactive frame rates. The swarm emerges before your eyes." },
        { "title": "Shell Layer", "text": "Godot is the effectful shell around the pure simulation core. Rendering, input, scene management — all at the boundary." }
      ]
    },
    {
      "id": "pramana-bloch",
      "label": "Bloch Equations",
      "kind": "moon",
      "mass": 0.15,
      "color": [0.6, 0.3, 0.9],
      "description": "Lesson 00. The hello world of quantum sensing.",
      "facets": [
        { "title": "The Equations", "text": "dM/dt = γ(M × B) − relaxation. Three coupled ODEs describing spin precession in a magnetic field with T1 and T2 decay." },
        { "title": "RK4 Integrator", "text": "Fourth-order Runge-Kutta integration. Stable, accurate, and simple enough to implement in all three languages for cross-validation." },
        { "title": "Rabi Oscillation", "text": "Apply a resonant RF field and watch the magnetization vector nutate between up and down. The fundamental operation of quantum measurement." },
        { "title": "Relaxation", "text": "T1 (longitudinal) and T2 (transverse) relaxation. The spin system's return to equilibrium — different timescales, different physics, both essential." }
      ]
    },
    {
      "id": "pramana-demo",
      "label": "Interactive Demo",
      "kind": "moon",
      "mass": 0.12,
      "color": [0.8, 0.5, 1.0],
      "description": "Self-contained HTML demo. The invitation to collaborators.",
      "facets": [
        { "title": "3D Bloch Sphere", "text": "WebGL-rendered Bloch sphere with real-time magnetization vector. Watch the spin precess, nutate, and relax in three dimensions." },
        { "title": "Live Controls", "text": "Sliders for B0 field strength, RF amplitude, T1/T2 relaxation times, and detuning. Presets for common experiments. Immediate visual feedback." },
        { "title": "Self-Contained", "text": "Single HTML file, no build step, no dependencies beyond Three.js CDN. Clone the repo and open in a browser. The lowest possible barrier to entry." }
      ]
    }
  ],
  "bonds": [
    { "from": "mayajiva", "to": "mayaportal", "kind": "renders-through", "strength": 0.9 },
    { "from": "bravli", "to": "mayapramana", "kind": "methodology-feeds", "strength": 0.5 },
    { "from": "mayadevgeni", "to": "mayaloom", "kind": "spawns", "strength": 0.7 },
    { "from": "mayapramana", "to": "manifesto", "kind": "instantiates", "strength": 0.6 },
    { "from": "mayaportal", "to": "manifesto", "kind": "instantiates", "strength": 0.5 },
    { "from": "mayadevgeni", "to": "manifesto", "kind": "operationalizes", "strength": 0.8 },
    { "from": "bravli", "to": "mayajiva", "kind": "inspires", "strength": 0.3 },
    { "from": "mayaloom", "to": "mayapramana", "kind": "structures", "strength": 0.6 }
  ]
}
